касса_Вегас/src/DataProcessors/Сервис/Сервис.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Сервис</name>
</mdclass:DataProcessor>

касса_Вегас/src/Enums/НастройкиПользователя/НастройкиПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НастройкиПользователя</name>
  <enumValues>
    <name>ВидАдресаПодключенияWS</name>
  </enumValues>
  <enumValues>
    <name>ЕГАИСПериодСпискаТТН</name>
  </enumValues>
  <enumValues>
    <name>ЖурналПродажиАлкогольнойПродукцииВыводитьТитульныйЛист</name>
  </enumValues>
  <enumValues>
    <name>ЖурналПродажиАлкогольнойПродукцииПериод</name>
  </enumValues>
  <enumValues>
    <name>ИмпортПрайсЛистаВариантПоиска</name>
  </enumValues>
  <enumValues>
    <name>ИмпортПрайсЛистаГруппа</name>
  </enumValues>
  <enumValues>
    <name>ИмпортПрайсЛистаЕдИзм</name>
  </enumValues>
  <enumValues>
    <name>ИмпортПрайсЛистаПутьКФайлу</name>
  </enumValues>
  <enumValues>
    <name>ИмпортПрайсЛистаСтавкаНДС</name>
  </enumValues>
  <enumValues>
    <name>КассаВозвратРазвернуто</name>
  </enumValues>
  <enumValues>
    <name>КассаПродажаРазвернуто</name>
  </enumValues>
  <enumValues>
    <name>Кассир</name>
  </enumValues>
  <enumValues>
    <name>ОтчетГеоВариант</name>
    <comment>0 - ПоКассовойСмене, 1 -  </comment>
  </enumValues>
  <enumValues>
    <name>ОтчетГеоПериод</name>
  </enumValues>
  <enumValues>
    <name>ОтчетГеоПоГоризонтали</name>
  </enumValues>
  <enumValues>
    <name>ОтчетПродажиВариант</name>
    <comment>0 - ПоКассовойСмене, 1 -  </comment>
  </enumValues>
  <enumValues>
    <name>ОтчетПродажиПериод</name>
  </enumValues>
  <enumValues>
    <name>ОтчетПродажиПоГоризонтали</name>
  </enumValues>
  <enumValues>
    <name>ПериодСпискаЧеков</name>
  </enumValues>
  <enumValues>
    <name>ПодборТоваровВариантСортировки</name>
  </enumValues>
  <enumValues>
    <name>ПодборТоваровИзбранное</name>
  </enumValues>
  <enumValues>
    <name>ПодборТоваровОтборПоГруппеЗначение</name>
  </enumValues>
  <enumValues>
    <name>ПодборТоваровОтборПоГруппеФлаг</name>
  </enumValues>
  <enumValues>
    <name>ПодборТоваровПоискПоШтрихкодуВручнуюФлаг</name>
  </enumValues>
  <enumValues>
    <name>ПрайсЛистВариантСортировки</name>
  </enumValues>
  <enumValues>
    <name>ПрайсЛистИзбранное</name>
  </enumValues>
  <enumValues>
    <name>ПрайсЛистОтборПоГруппеЗначение</name>
  </enumValues>
  <enumValues>
    <name>ПрайсЛистОтборПоГруппеФлаг</name>
  </enumValues>
  <enumValues>
    <name>ПрайсЛистПоискПоШтрихкодуВручнуюФлаг</name>
  </enumValues>
  <enumValues>
    <name>ФильтрСпискаЗаказов</name>
  </enumValues>
  <enumValues>
    <name>ЭтикеткиЦенникиРежимПечати</name>
  </enumValues>
</mdclass:Enum>

касса_Вегас/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <enumValues>
    <name>БезНДС</name>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
  </enumValues>
  <enumValues>
    <name>НДС10_110</name>
  </enumValues>
  <enumValues>
    <name>НДС18</name>
  </enumValues>
  <enumValues>
    <name>НДС18_118</name>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
  </enumValues>
  <enumValues>
    <name>НДС20_120</name>
  </enumValues>
</mdclass:Enum>

касса_Вегас/src/Enums/ПризнакиПредметаРасчета/ПризнакиПредметаРасчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПризнакиПредметаРасчета</name>
  <enumValues>
    <name>Товар</name>
    <comment>Реализуемый товар, за исключением подакцизного товара</comment>
  </enumValues>
  <enumValues>
    <name>ПодакцизныйТовар</name>
    <comment>Реализуемый подакцизный товар</comment>
  </enumValues>
  <enumValues>
    <name>Работа</name>
    <comment>Выполняемая работа</comment>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
    <comment>Оказываемая услуга</comment>
  </enumValues>
  <enumValues>
    <name>СтавкаАзартнойИгры</name>
    <comment>Прием ставок при осуществлении деятельности по проведению азартных игр</comment>
  </enumValues>
  <enumValues>
    <name>ВыигрышАзартнойИгры</name>
    <comment>Выплата денежных средств в виде выигрыша при осуществлении деятельности по проведению азартных игр</comment>
  </enumValues>
  <enumValues>
    <name>ЛотерейныйБилет</name>
    <comment>Прием денежных средств при реализации лотерейных билетов</comment>
  </enumValues>
  <enumValues>
    <name>ВыигрышЛотереи</name>
    <comment>Выплата денежных средств в виде выигрыша при осуществлении деятельности по проведению лотерей</comment>
  </enumValues>
  <enumValues>
    <name>ПредоставлениеРИД</name>
    <comment>Предоставлении прав на использование результатов интеллектуальной деятельности или средств индивидуализации</comment>
  </enumValues>
  <enumValues>
    <name>ПлатежВыплата</name>
    <comment>Аванс, задаток, предоплата, кредит, взнос в счет оплаты, пени, штраф, вознаграждение, бонус и ином аналогичном предмете расчета</comment>
  </enumValues>
  <enumValues>
    <name>АгентскоеВознаграждение</name>
    <comment>Вознаграждение пользователя, являющегося платежным агентом (субагентом), банковским платежным агентом (субагентом), комиссионером, поверенным или иным агентом</comment>
  </enumValues>
  <enumValues>
    <name>СоставнойПредметРасчета</name>
    <comment>Предмет расчета, состоящем из предметов, каждому из которых может быть присвоено другие значения перечисления</comment>
  </enumValues>
  <enumValues>
    <name>ИнойПредметРасчета</name>
    <comment>Предмет расчета,  не относящемуся к предметам расчета, которым может быть присвоено значение перечисления</comment>
  </enumValues>
  <enumValues>
    <name>ИмущественноеПраво</name>
    <comment>Передача имущественных прав</comment>
  </enumValues>
  <enumValues>
    <name>ВнереализационныйДоход</name>
    <comment>Внереализационный доход</comment>
  </enumValues>
  <enumValues>
    <name>СтраховыеВзносы</name>
    <comment>Сумма расходов, уменьшающих сумму налога (авансовых платежей) в соответствии с пунктом 3.1 статьи 346.21 Налогового кодекса РФ</comment>
  </enumValues>
  <enumValues>
    <name>ТорговыйСбор</name>
    <comment>Сумма уплаченного торгового сбора</comment>
  </enumValues>
  <enumValues>
    <name>КурортныйСбор</name>
    <comment>Курортный сбор</comment>
  </enumValues>
  <enumValues>
    <name>Залог</name>
    <comment>Залог</comment>
  </enumValues>
</mdclass:Enum>

касса_Вегас/src/DataProcessors/Сервис/Forms/ИмпортПрайсЛиста/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначения.ВосстановитьНастройкуПользователя(Перечисления.НастройкиПользователя.ИмпортПрайсЛистаПутьКФайлу,    ПутьКФайлуИмпорта);
	ОбщегоНазначения.ВосстановитьНастройкуПользователя(Перечисления.НастройкиПользователя.ИмпортПрайсЛистаСтавкаНДС,     СтавкаНДСПоУмолчанию);
	ОбщегоНазначения.ВосстановитьНастройкуПользователя(Перечисления.НастройкиПользователя.ИмпортПрайсЛистаЕдИзм,         ЕдиницаИзмеренияПоУмолчанию);
	ОбщегоНазначения.ВосстановитьНастройкуПользователя(Перечисления.НастройкиПользователя.ИмпортПрайсЛистаВариантПоиска, ВариантПоиска);
	ОбщегоНазначения.ВосстановитьНастройкуПользователя(Перечисления.НастройкиПользователя.ИмпортПрайсЛистаГруппа,        ГруппаПоУмолчанию);
	
	ЗаполнитьСписокСтавокНДС();
	
	Если НЕ ЗначениеЗаполнено(СтавкаНДСПоУмолчанию) Тогда
		
		СтавкаНДСПоУмолчанию = ЦенообразованиеКлиентСервер.ПолучитьСтавку_18_20(Перечисления.СтавкиНДС.НДС18);
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЕдиницаИзмеренияПоУмолчанию) Тогда
		ЕдиницаИзмеренияПоУмолчанию = ОбщегоНазначенияПовтИсп.ПолучитьЕдиницуИзмерения("шт");
	КонецЕсли;
	
	ПредметРасчетаПоУмолчанию = Перечисления.ПризнакиПредметаРасчета.Товар;
	
	НастроитьФормуПоЗначениямНастроек();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПутьКФайлуИмпортаПоУмолчанию = КаталогДокументов() + "import.xml";
	
	Если НЕ ЗначениеЗаполнено(ПутьКФайлуИмпорта) Тогда
		ПутьКФайлуИмпорта = ПутьКФайлуИмпортаПоУмолчанию;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	#Если МобильноеПриложениеКлиент Тогда
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	#КонецЕсли
	
	ПередЗакрытиемСервер();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПутьКФайлу(Команда)
	
	ПутьКФайлуИмпорта = ПутьКФайлуИмпортаПоУмолчанию;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайлИмпорта(Команда)
	
	ОчиститьСообщения();
	
	ЕстьОшибки = Ложь;
	
	Если ПроверитьЗаполнениеФормы() Тогда
		
		Файл = Новый Файл(ПутьКФайлуИмпорта);
		Если НЕ Файл.Существует() Тогда
			СообщениеОбОшибке = НСтр("ru = 'Указанный файл не обнаружен'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке);
			ЕстьОшибки = Истина;
			Возврат;
		КонецЕсли;
	Иначе
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	ОбщегоНазначенияВызовСервера.ОбновитьПовторноИспользуемыеЗначенияСервер();
	
	Если Не ЕстьОшибки Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеПослеЗагрузкиПрайсЛиста", ЭтотОбъект);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ПутьКФайлу", ПутьКФайлуИмпорта);
		ПараметрыФормы.Вставить("ВариантПоиска", ВариантПоиска);
		ПараметрыФормы.Вставить("СтавкаНДСПоУмолчанию", СтавкаНДСПоУмолчанию);
		ПараметрыФормы.Вставить("ЕдиницаИзмеренияПоУмолчанию", ЕдиницаИзмеренияПоУмолчанию);
		ПараметрыФормы.Вставить("ГруппаПоУмолчанию", ГруппаПоУмолчанию);
		ПараметрыФормы.Вставить("ПредметРасчетаПоУмолчанию", ПредметРасчетаПоУмолчанию);
		
		ОткрытьФорму("Обработка.Сервис.Форма.ИмпортПрайсЛистаДанныеЗагрузки", ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПроверитьЗаполнениеФормы()
	
	Если НЕ ЗначениеЗаполнено(ПутьКФайлуИмпорта) Тогда
		
		ПомощникUIКлиент.СообщитьПолеНеЗаполнено(ЭтотОбъект, Элементы.ПутьКФайлуИмпорта, НСтр("ru = 'Путь к файлу'"));
		
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтавкаНДСПоУмолчанию) Тогда
		
		ПомощникUIКлиент.СообщитьПолеНеЗаполнено(ЭтотОбъект, Элементы.СтавкаНДСПоУмолчанию, НСтр("ru = 'Ставка НДС'"));
		
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЕдиницаИзмеренияПоУмолчанию) Тогда
		
		ПомощникUIКлиент.СообщитьПолеНеЗаполнено(ЭтотОбъект, Элементы.ЕдиницаИзмеренияПоУмолчанию, НСтр("ru = 'Единица измерения'"));
		
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПредметРасчетаПоУмолчанию) Тогда
		
		ПомощникUIКлиент.СообщитьПолеНеЗаполнено(ЭтотОбъект, Элементы.ПредметРасчетаПоУмолчанию, НСтр("ru = 'Предмет расчета'"));
		
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ПередЗакрытиемСервер()
	
	ОбщегоНазначенияВызовСервера.СохранитьНастройкуПользователя("ИмпортПрайсЛистаПутьКФайлу",    ПутьКФайлуИмпорта);
	ОбщегоНазначенияВызовСервера.СохранитьНастройкуПользователя("ИмпортПрайсЛистаСтавкаНДС",     СтавкаНДСПоУмолчанию);
	ОбщегоНазначенияВызовСервера.СохранитьНастройкуПользователя("ИмпортПрайсЛистаЕдИзм",         ЕдиницаИзмеренияПоУмолчанию);
	ОбщегоНазначенияВызовСервера.СохранитьНастройкуПользователя("ИмпортПрайсЛистаВариантПоиска", ВариантПоиска);
	ОбщегоНазначенияВызовСервера.СохранитьНастройкуПользователя("ИмпортПрайсЛистаГруппа",        ГруппаПоУмолчанию);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеПослеЗагрузкиПрайсЛиста(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		
		ТекстСообщения = НСтр("ru = 'Импорт прайс-листа успешно завершен'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокСтавокНДС()
	
	Элементы.СтавкаНДСПоУмолчанию.СписокВыбора.Очистить();
	
	Если ЦенообразованиеКлиентСервер.ПрименяетсяСтавкаНДС20() Тогда
		Элементы.СтавкаНДСПоУмолчанию.СписокВыбора.Добавить(Перечисления.СтавкиНДС.НДС20, НСтр("ru = '20%'"));
	Иначе
		Элементы.СтавкаНДСПоУмолчанию.СписокВыбора.Добавить(Перечисления.СтавкиНДС.НДС18, НСтр("ru = '18%'"));
	КонецЕсли;
	
	Элементы.СтавкаНДСПоУмолчанию.СписокВыбора.Добавить(Перечисления.СтавкиНДС.НДС10, НСтр("ru = '10%'"));
	Элементы.СтавкаНДСПоУмолчанию.СписокВыбора.Добавить(Перечисления.СтавкиНДС.НДС0,  НСтр("ru = '0%'"));
	Элементы.СтавкаНДСПоУмолчанию.СписокВыбора.Добавить(Перечисления.СтавкиНДС.БезНДС, НСтр("ru = 'Без НДС'"));
	
КонецПроцедуры

#КонецОбласти
